; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city7)
	(= (capacity plane1) 9206)
	(= (fuel plane1) 506)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 12)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city1)
	(= (capacity plane2) 2169)
	(= (fuel plane2) 751)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 2)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city0)
	(= (capacity plane3) 5645)
	(= (fuel plane3) 1679)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 4)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 3)
	(at plane4 city1)
	(= (capacity plane4) 2766)
	(= (fuel plane4) 378)
	(= (slow-burn plane4) 1)
	(= (fast-burn plane4) 3)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 6)
	(at person1 city6)
	(at person2 city7)
	(at person3 city5)
	(at person4 city6)
	(at person5 city5)
	(at person6 city0)
	(at person7 city2)
	(at person8 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 609)
	(= (distance city0 city2) 687)
	(= (distance city0 city3) 739)
	(= (distance city0 city4) 903)
	(= (distance city0 city5) 731)
	(= (distance city0 city6) 878)
	(= (distance city0 city7) 705)
	(= (distance city1 city0) 609)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 697)
	(= (distance city1 city3) 593)
	(= (distance city1 city4) 951)
	(= (distance city1 city5) 593)
	(= (distance city1 city6) 633)
	(= (distance city1 city7) 731)
	(= (distance city2 city0) 687)
	(= (distance city2 city1) 697)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 948)
	(= (distance city2 city4) 659)
	(= (distance city2 city5) 694)
	(= (distance city2 city6) 879)
	(= (distance city2 city7) 766)
	(= (distance city3 city0) 739)
	(= (distance city3 city1) 593)
	(= (distance city3 city2) 948)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 567)
	(= (distance city3 city5) 624)
	(= (distance city3 city6) 719)
	(= (distance city3 city7) 532)
	(= (distance city4 city0) 903)
	(= (distance city4 city1) 951)
	(= (distance city4 city2) 659)
	(= (distance city4 city3) 567)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 927)
	(= (distance city4 city6) 567)
	(= (distance city4 city7) 691)
	(= (distance city5 city0) 731)
	(= (distance city5 city1) 593)
	(= (distance city5 city2) 694)
	(= (distance city5 city3) 624)
	(= (distance city5 city4) 927)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 678)
	(= (distance city5 city7) 679)
	(= (distance city6 city0) 878)
	(= (distance city6 city1) 633)
	(= (distance city6 city2) 879)
	(= (distance city6 city3) 719)
	(= (distance city6 city4) 567)
	(= (distance city6 city5) 678)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 889)
	(= (distance city7 city0) 705)
	(= (distance city7 city1) 731)
	(= (distance city7 city2) 766)
	(= (distance city7 city3) 532)
	(= (distance city7 city4) 691)
	(= (distance city7 city5) 679)
	(= (distance city7 city6) 889)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city6)
	(at plane3 city5)
	(at person1 city7)
	(at person2 city5)
	(at person3 city7)
	(at person4 city5)
	(at person5 city3)
	(at person6 city5)
	(at person8 city5)
	))

(:metric minimize (+ (* 2 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city7)
   changed: (fuel plane1) from 506 to 9206
   goals met: 1 of 9
2. (fly plane2 city1 city5)
   deleted: (at plane2 city1)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 0 to 593, (fuel plane2) from 751 to 158
   goals met: 1 of 9
3. (board person6 plane3 city0)
   deleted: (at person6 city0)
   added: (in person6 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 1 of 9
4. (board person2 plane1 city7)
   deleted: (at person2 city7)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 9
5. (fly plane1 city7 city5)
   deleted: (at plane1 city7)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 593 to 3309, (fuel plane1) from 9206 to 6490
   goals met: 1 of 9
6. (fly plane3 city0 city5)
   deleted: (at plane3 city0)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 3309 to 4771, (fuel plane3) from 1679 to 217
   goals met: 2 of 9
7. (debark person2 plane1 city5)
   deleted: (in person2 plane1)
   added: (at person2 city5)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 9
8. (debark person6 plane3 city5)
   deleted: (in person6 plane3)
   added: (at person6 city5)
   changed: (onboard plane3) from 1 to 0
   goals met: 4 of 9
9. (board person3 plane1 city5)
   deleted: (at person3 city5)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 9
10. (board person5 plane1 city5)
   deleted: (at person5 city5)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 9
11. (fly plane1 city5 city6)
   deleted: (at plane1 city5)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 4771 to 7483, (fuel plane1) from 6490 to 3778
   goals met: 5 of 9
12. (board person1 plane1 city6)
   deleted: (at person1 city6)
   added: (in person1 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 5 of 9
13. (board person4 plane1 city6)
   deleted: (at person4 city6)
   added: (in person4 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 5 of 9
14. (fly plane1 city6 city7)
   deleted: (at plane1 city6)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 7483 to 11039, (fuel plane1) from 3778 to 222
   goals met: 4 of 9
15. (debark person1 plane1 city7)
   deleted: (in person1 plane1)
   added: (at person1 city7)
   changed: (onboard plane1) from 4 to 3
   goals met: 5 of 9
16. (debark person3 plane1 city7)
   deleted: (in person3 plane1)
   added: (at person3 city7)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 9
17. (refuel plane1 city7)
   changed: (fuel plane1) from 222 to 9206
   goals met: 6 of 9
18. (fly plane1 city7 city5)
   deleted: (at plane1 city7)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 11039 to 13755, (fuel plane1) from 9206 to 6490
   goals met: 6 of 9
19. (debark person4 plane1 city5)
   deleted: (in person4 plane1)
   added: (at person4 city5)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 9
20. (fly plane1 city5 city3)
   deleted: (at plane1 city5)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 13755 to 16251, (fuel plane1) from 6490 to 3994
   goals met: 7 of 9
21. (debark person5 plane1 city3)
   deleted: (in person5 plane1)
   added: (at person5 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 9
22. (fly plane1 city3 city6)
   deleted: (at plane1 city3)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 16251 to 19127, (fuel plane1) from 3994 to 1118
   goals met: 9 of 9
